Revit 2024 API
Entity.WriteAccessGranted Method
 Checks whether this Entity may be stored by the current add-in.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool WriteAccessGranted()
Visual Basic
Public Function WriteAccessGranted As Boolean
Visual C++
public:
bool WriteAccessGranted()
Return Value
 True if write access is allowed.
See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace